'''提示用户"请输入您的性别"
1)如果输入"男",则提示"您有房吗？",输入有或没有后
继续提示"您有车吗？",输入有或没有后进行判断，如果既有房又有车则打印
"恭喜您事业有成，敢问钱是哪来的？",否则打印"人间不值得";
2)如果输入"女",则提示"您白吗？",输入白或不白后继续提示"腿长吗?",
输入长或不长后进行判断,如果既白腿又长则打印"老娘肤白貌美大长腿",
否则打印"好好的活着";
3)如果性别既不是男也不是女,则打印"性别有误，请重新输入"'''
sex = input('请输入您的性别：')
if sex == '男':
    house = input('您有房吗？')
    car = input('您有车吗？')
    if house == '有' and car == '有':
        print('恭喜您事业有成，敢问钱是哪来的？')
    else:
        print('人间不值得')
elif sex == '女':
    white = input('您白吗？')
    long = input('腿长吗？')
    if white == '白' and long == '长':
        print('老娘肤白貌美大长腿')
    else:
        print('好好的活着')
else:
    print('性别有误，请重新输入')